#lang racket

(require rackunit
         apertium-kaz)

(check-equal?
 (kaz-tagger-deterministic "Еуровидение 2010 ән конкурсы Еуровидениенің 55-ші конкурсы болады.")
 "^Еуровидение/Еуровидение<np><al><nom>$ ^2010/2010<num><ord>$ ^ән/ән<n><nom>$ ^конкурсы/конкурс<n><px3sp><nom>$ ^Еуровидениенің/Еуровидение<np><al><gen>$ ^55-ші/55<num><ord>$ ^конкурсы/конкурс<n><px3sp><nom>$ ^болады/бол<v><iv><aor><p3><sg>$^./.<sent>$")

(check-equal?
 (kaz-disam "Еуровидение 2010 ән конкурсы Еуровидениенің 55-ші конкурсы болады.")
  "^Еуровидение/Еуровидение<np><al><nom><#1->4><@nmod:poss>$^2010/2010<num><ord><#2->4><@amod>$^ән/ән<n><nom><#3->4><@nmod:poss>$^конкурсы/конкурс<n><px3sp><nom><#4->7><@nsubj>$^Еуровидениенің/Еуровидение<np><al><gen><#5->7><@nmod:poss>$^55-ші/55<num><ord><#6->7><@amod>$^конкурсы/конкурс<n><px3sp><nom><#7->0><@root>$^болады/бол<v><iv><aor><p3><sg><#8->7><@cop>$^./.<sent><#9->7><@punct>$")


(check-equal?
 (kaz-tagger-deterministic "Қой, қазақ бұлармен не ғып соғыса алсын?")
 "^Қой/қой<v><tv><imp><p2><sg>$^,/,<cm>$ ^қазақ/қазақ<n><nom>$ ^бұлармен/бұл<prn><dem><pl><ins>$ ^не/не<prn><itg><nom>$ ^ғып/қыл<v><tv><gna_perf>$ ^соғыса/соғыс<v><iv><prc_impf>$ ^алсын/ал<vaux><opt><p3><sg>$^?/?<sent>$")

(check-equal?
 (kaz-disam "Қой, қазақ бұлармен не ғып соғыса алсын?")
 "^Қой/қой<v><tv><imp><p2><sg><#1->0><@root>$^,/,<cm><#2->1><@punct>$^қазақ/қазақ<n><nom><#3->7><@nsubj>$^бұлармен/бұл<prn><dem><pl><ins><#4->7><@obl>$^не/не<prn><itg><nom><#5->6><@obj>$^ғып/қыл<v><tv><gna_perf><#6->7><@advcl>$^соғыса/соғыс<v><iv><prc_impf><#7->1><@parataxis>$^алсын/ал<vaux><opt><p3><sg><#8->7><@aux>$^?/?<sent><#9->1><@punct>$")


(check-equal?
 (kaz-tagger-deterministic "Қазақстан осы өңірдегі бейбітшілікті қолдайды.")
 "^Қазақстан/Қазақстан<np><top><nom>$ ^осы/осы<det><dem>$ ^өңірдегі/өңір<n><loc><attr>$ ^бейбітшілікті/бейбітшілік<n><acc>$ ^қолдайды/қолда<v><tv><aor><p3><sg>$^./.<sent>$")

(check-equal?
 (kaz-disam "Қазақстан осы өңірдегі бейбітшілікті қолдайды.")
 "^Қазақстан/Қазақстан<np><top><nom><#1->5><@nsubj>$^осы/осы<det><dem><#2->3><@det>$^өңірдегі/өңір<n><loc><attr><#3->4><@amod>$^бейбітшілікті/бейбітшілік<n><acc><#4->5><@obj>$^қолдайды/қолда<v><tv><aor><p3><sg><#5->0><@root>$^./.<sent><#6->5><@punct>$")


(check-equal?
 (kaz-tagger-deterministic "Дмитрий Медведевтің Астанаға сапары 22 мамырға жоспарланып отыр.")
 "^Дмитрий/Дмитрий<np><ant><m><nom>$ ^Медведевтің/Медведев<np><cog><m><gen>$ ^Астанаға/Астана<np><top><dat>$ ^сапары/сапар<n><px3sp><nom>$ ^22/22<num><ord>$ ^мамырға/мамыр<n><dat>$ ^жоспарланып/жоспарла<v><tv><pass><prc_perf>$ ^отыр/отыр<vaux><pres><p3><sg>$^./.<sent>$")

(check-equal? ;; discuss this, looks wrong
 (kaz-disam "Дмитрий Медведевтің Астанаға сапары 22 мамырға жоспарланып отыр.")
 "^Дмитрий/Дмитрий<np><ant><m><nom><#1->4><@nmod:poss>$^Медведевтің/Медведев<np><cog><m><gen><#2->4><@nmod:poss>$^Астанаға/Астана<np><top><dat><#3->8><@obl>$^сапары/сапар<n><px3sp><nom><#4->8><@nsubj>$^22/22<num><ord><#5->8><@amod>$^мамырға/мамыр<n><dat><#6->8><@obl>$^жоспарланып/жоспарла<v><tv><pass><prc_perf><#7->8>$^отыр/отыр<vaux><pres><p3><sg><#8->0><@root>$^./.<sent><#9->8><@punct>$") ;; TODO clarify with FMT and JNW or guidelines: 1. сапары nsubj 2. attachingастанаға to сапары (as nmod?)


(check-equal?
 (kaz-tagger-deterministic "Біздің елде сізге ерекше құрметпен қарайды.")
 "^Біздің/біз<prn><pers><p1><pl><gen>$ ^елде/ел<n><loc>$ ^сізге/сіз<prn><pers><p2><sg><frm><dat>$ ^ерекше/ерекше<adj>$ ^құрметпен/құрмет<n><ins>$ ^қарайды/қара<v><tv><aor><p3><pl>$^./.<sent>$")

(check-equal?
 (kaz-disam "Біздің елде сізге ерекше құрметпен қарайды.")
 "^Біздің/біз<prn><pers><p1><pl><gen><#1->2><@nmod:poss>$^елде/ел<n><loc><#2->6><@obl>$^сізге/сіз<prn><pers><p2><sg><frm><dat><#3->6><@obl>$^ерекше/ерекше<adj><#4->5><@amod>$^құрметпен/құрмет<n><ins><#5->6><@obl>$^қарайды/қара<v><tv><aor><p3><pl><#6->0><@root>$^./.<sent><#7->6><@punct>$")


(check-equal?
 (kaz-tagger-deterministic "- Біздің Үкімет бұл жобаны міндетті түрде қолдайды.")
 "^-/-<guio>$ ^Біздің/біз<prn><pers><p1><pl><gen>$ ^Үкімет/үкімет<n><nom>$ ^бұл/бұл<det><dem>$ ^жобаны/жоба<n><acc>$ ^міндетті/міндетті<adj>$ ^түрде/түр<n><loc>$ ^қолдайды/қолда<v><tv><aor><p3><sg>$^./.<sent>$")

(check-equal?
 (kaz-disam "- Біздің Үкімет бұл жобаны міндетті түрде қолдайды.")
 "^-/-<guio><#1->8><@punct>$^Біздің/біз<prn><pers><p1><pl><gen><#2->3><@nmod:poss>$^Үкімет/үкімет<n><nom><#3->8><@nsubj>$^бұл/бұл<det><dem><#4->5><@det>$^жобаны/жоба<n><acc><#5->8><@obj>$^міндетті/міндетті<adj><#6->7><@amod>$^түрде/түр<n><loc><#7->8><@obl>$^қолдайды/қолда<v><tv><aor><p3><sg><#8->0><@root>$^./.<sent><#9->8><@punct>$")


(check-equal?
 (kaz-tagger-deterministic "- Көші-қон мәселелерін реттеу Қазақстан үшін маңызды болып саналады.")
 "^-/-<guio>$ ^Көші-қон/көші-қон<n><nom>$ ^мәселелерін/мәселе<n><pl><px3sp><acc>$ ^реттеу/ретте<v><tv><ger><nom>$ ^Қазақстан/Қазақстан<np><top><nom>$ ^үшін/үшін<post>$ ^маңызды/маңызды<adj>$ ^болып/бол<v><iv><gna_perf>$ ^саналады/сана<v><tv><pass><aor><p3><sg>$^./.<sent>$")

(check-equal?
 (kaz-disam "- Көші-қон мәселелерін реттеу Қазақстан үшін маңызды болып саналады.")
 "^-/-<guio><#1->9><@punct>$^Көші-қон/көші-қон<n><nom><#2->3><@nmod:poss>$^мәселелерін/мәселе<n><pl><px3sp><acc><#3->4><@obj>$^реттеу/ретте<v><tv><ger><nom><#4->9><@csubj>$^Қазақстан/Қазақстан<np><top><nom><#5->9><@obl>$^үшін/үшін<post><#6->5><@case>$^маңызды/маңызды<adj><#7->9><@advcl>$^болып/бол<v><iv><gna_perf><#8->7><@cop>$^саналады/сана<v><tv><pass><aor><p3><sg><#9->0><@root>$^./.<sent><#10->9><@punct>$")


(check-equal?
 (kaz-tagger-deterministic "Қазіргі кезде қаланың ішкі өңірлік өнімі 20 есе өсті.")
 "^Қазіргі/қазір<adv><attr>$ ^кезде/кез<n><loc>$ ^қаланың/қала<n><gen>$ ^ішкі/ішкі<adj>$ ^өңірлік/өңірлік<adj>$ ^өнімі/өнім<n><px3sp><nom>$ ^20/20<num>$ ^есе/есе<n><nom>$ ^өсті/өс<v><iv><ifi><p3><sg>$^./.<sent>$")

(check-equal?
 (kaz-disam "Қазіргі кезде қаланың ішкі өңірлік өнімі 20 есе өсті.")
 "^Қазіргі/қазір<adv><attr><#1->2><@amod>$^кезде/кез<n><loc><#2->9><@obl>$^қаланың/қала<n><gen><#3->6><@nmod:poss>$^ішкі/ішкі<adj><#4->6><@amod>$^өңірлік/өңірлік<adj><#5->6><@amod>$^өнімі/өнім<n><px3sp><nom><#6->9><@nsubj>$^20/20<num><#7->8><@nummod>$^есе/есе<n><nom><#8->9><@obj>$^өсті/өс<v><iv><ifi><p3><sg><#9->0><@root>$^./.<sent><#10->9><@punct>$")

